note/note-threat_intelligence_scrapy.org
#+TITLE: Threat Intelligence 情报收集爬虫

此文档记录了爬取开源情报的一些细节，[[https://github.com/Nanue1/opensource_threat_intel][爬虫项目]] 已经不再更新!

* data source introduction
** ioc数据基本信息说明
   - 情报指标维度

      | indictor | 存储值 |
      |----------+--------|
      | ip       |      0 |
      |----------+--------|
      | domain   |      1 |
      |----------+--------|
      | url      |      2 |
      |----------+--------|
      | md5      |      3 |
      |----------+--------|
      | sha256   |      4 |
      |----------+--------|
      | sha1     |      5 |
      |----------+--------|
   - tags 标签说明

     | 序号 | 恶意类型     | 说明           |
     |------+--------------+----------------|
     |    0 | Suspicious   | 可疑的         |
     |------+--------------+----------------|
     |    1 | DDos         | DDos攻击       |
     |------+--------------+----------------|
     |    2 | Exploits     | 漏洞攻击       |
     |------+--------------+----------------|
     |    3 | Spam Sources | 垃圾邮件       |
     |------+--------------+----------------|
     |    4 | Web  Attacks | Web攻击        |
     |------+--------------+----------------|
     |    5 | Scanners     | 扫描源         |
     |------+--------------+----------------|
     |    6 | Botnets      | 僵尸网络被控端 |
     |------+--------------+----------------|
     |    7 | Malware      | 恶意软件       |
     |------+--------------+----------------|
     |    8 | Phishing     | 钓鱼           |
     |------+--------------+----------------|
     |    9 | Proxy        | 代理           |
     |------+--------------+----------------|
     |   10 | C&C          | 僵尸网络控制端 |
     |------+--------------+----------------|
     |   11 | Whitelist    | 白名单         |
     |------+--------------+----------------|
     |   12 | Honeypot     | 蜜罐           |
     |------+--------------+----------------|
     |   13 | DGA          | 域名随机生成   |
     |------+--------------+----------------|
   - confidence 可信度字段说明
     | 置信度 | 取值范围说明       |
     |--------+--------------------|
     | (9-10) | Certain            |
     |--------+--------------------|
     | (7-8)  | Very Confident     |
     |--------+--------------------|
     | (6-7)  | Somewhat Confident |
     |--------+--------------------|
     | (5-6)  | Not Confident      |
     |--------+--------------------|
     | (5)    | "50/50 shot"       |
     |--------+--------------------|
     | (0-4)  | Informational Data |
     |--------+--------------------|
   - 数据库内存储格式
     + 录入机制:

       同一数据源来的数据，威胁类型不变时，

       只更新该类型记录更新时间,created_time不会变化
     
       当indicator 和 tag都变化的时候，才会录入一条新的数据
     + 更新机制

       每天通过created_time获取新数据
     #+BEGIN_SRC json
     {
        "indicator":"1.180.74.58",
        "data_type":0,
        "confidence":7,
        "alive":true/false,
        "updated_time":"2017-06-30T14:22:44"/"none",
        "source":"blocklist.de",
        "tag":5,
        "created_time":"2017-06-30T14:22:44"
        "description":""
     }
     #+END_SRC
