note/note-threat_intelligence_scrapy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-25 Fri 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Threat Intelligence 情报收集爬虫</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="manue1" />
<link rel="stylesheet" type="text/css" href="https://www.manue1.site/css/style.css" />
<link rel="shortcut icon" href="https://www.manue1.site/images/hack_favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.site">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">Threat Intelligence 情报收集爬虫</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org00ee8d5">1. data source introduction</a>
<ul>
<li><a href="#org2852fce">1.1. ioc数据基本信息说明</a></li>
<li><a href="#orgdde264a">1.2. 数据源各维度统计</a></li>
<li><a href="#orga4f9394">1.3. <span class="done DONE">DONE</span> reputation.alienvault.com</a></li>
<li><a href="#org46d1a4e">1.4. <span class="done DONE">DONE</span> osint.bambenekconsulting.com</a></li>
<li><a href="#orga8a5dff">1.5. <span class="done DONE">DONE</span> blocklist.de</a></li>
<li><a href="#org66283d7">1.6. <span class="done DONE">DONE</span> emergingthreats.net</a></li>
<li><a href="#org64794db">1.7. <span class="done DONE">DONE</span> netlab.360.com</a></li>
<li><a href="#org5a27fca">1.8. <span class="done DONE">DONE</span> abuse.ch</a>
<ul>
<li><a href="#org4085adf">1.8.1. <span class="done DONE">DONE</span> sslbl.abuse.ch</a></li>
<li><a href="#org51e8470">1.8.2. <span class="done DONE">DONE</span> zeustracker.abuse.ch</a></li>
<li><a href="#orgad59a23">1.8.3. <span class="done DONE">DONE</span> feodotracker.abuse.ch</a></li>
<li><a href="#org998a225">1.8.4. <span class="done DONE">DONE</span> ransomware.abuse.ch</a></li>
</ul>
</li>
<li><a href="#org719b6ab">1.9. <span class="done DONE">DONE</span> antispam.imp.ch</a></li>
<li><a href="#orgc024699">1.10. <span class="done DONE">DONE</span> alexa.com</a></li>
<li><a href="#orgcc7bbda">1.11. <span class="done DONE">DONE</span> public-dns.info</a></li>
<li><a href="#org06a353c">1.12. <span class="done DONE">DONE</span> umbrella.cisco.com</a></li>
<li><a href="#orgcd9aa08">1.13. <span class="done DONE">DONE</span> danger.rulez.sk</a></li>
<li><a href="#orga64f583">1.14. <span class="done DONE">DONE</span> csirtg.io</a></li>
<li><a href="#org35fac9d">1.15. <span class="done DONE">DONE</span> dataplane.org</a></li>
<li><a href="#org18f9b2a">1.16. <span class="done DONE">DONE</span> malc0de.com</a></li>
<li><a href="#orge77b9d7">1.17. <span class="done UNDO">UNDO</span> mirc.com</a></li>
<li><a href="#org0dd065a">1.18. <span class="done DONE">DONE</span> nothink.org</a></li>
<li><a href="#orgb222abc">1.19. <span class="done DONE">DONE</span> openphish.com</a></li>
<li><a href="#org1913748">1.20. <span class="done DONE">DONE</span> vxvazlt.net</a></li>
<li><a href="#orgf763a5f">1.21. <span class="done DONE">DONE</span> spamhaus.org</a></li>
<li><a href="#org63c94f9">1.22. <span class="done DONE">DONE</span> phishtank.com</a></li>
<li><a href="#org5934828">1.23. <span class="done DONE">DONE</span> dragonresearchgroup.org</a></li>
<li><a href="#orgc891e7b">1.24. <span class="done DONE">DONE</span> watcherlab.com</a></li>
<li><a href="#orgdcf09c6">1.25. <span class="todo TODO">TODO</span> isc.sans.edu</a></li>
<li><a href="#org1fea186">1.26. <span class="todo TODO">TODO</span> packetmail.net</a></li>
<li><a href="#orge750bce">1.27. <span class="todo TODO">TODO</span> otx.alienvault.com</a></li>
<li><a href="#org1451de0">1.28. <span class="todo TODO">TODO</span> malwaredomainlist.com</a></li>
<li><a href="#orgef16f39">1.29. <span class="todo TODO">TODO</span> badips.com</a></li>
<li><a href="#org57e5bdd">1.30. <span class="todo TODO">TODO</span> raw.githubusercontent.com</a></li>
<li><a href="#org7271ab7">1.31. <span class="todo TODO">TODO</span> cinsscore.com</a></li>
<li><a href="#org1a46bf0">1.32. <span class="todo TODO">TODO</span> cybercrime-tracker.net</a></li>
<li><a href="#org82b4e4a">1.33. <span class="todo TODO">TODO</span> dataplane.org</a></li>
<li><a href="#org889b1f6">1.34. <span class="todo TODO">TODO</span> blocklist.greensnow.co</a></li>
<li><a href="#orgd3ee650">1.35. <span class="todo TODO">TODO</span> malwaredomainlist.com</a></li>
<li><a href="#orgda81f55">1.36. <span class="todo TODO">TODO</span> maxmind.com</a></li>
<li><a href="#org2482fe4">1.37. <span class="todo TODO">TODO</span> rutgers.edu</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
此文档记录了爬取开源情报的一些细节，<a href="https://github.com/Nanue1/opensource_threat_intel">爬虫项目</a> 已经不再更新!
</p>

<div id="outline-container-org00ee8d5" class="outline-2">
<h2 id="org00ee8d5"><span class="section-number-2">1</span> data source introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2852fce" class="outline-3">
<h3 id="org2852fce"><span class="section-number-3">1.1</span> ioc数据基本信息说明</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><p>
情报指标维度
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">indictor</th>
<th scope="col" class="org-right">存储值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ip</td>
<td class="org-right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">domain</td>
<td class="org-right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">url</td>
<td class="org-right">2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">md5</td>
<td class="org-right">3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">sha256</td>
<td class="org-right">4</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">sha1</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table></li>
<li><p>
tags 标签说明
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">序号</th>
<th scope="col" class="org-left">恶意类型</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Suspicious</td>
<td class="org-left">可疑的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">DDos</td>
<td class="org-left">DDos攻击</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">Exploits</td>
<td class="org-left">漏洞攻击</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-left">Spam Sources</td>
<td class="org-left">垃圾邮件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">Web  Attacks</td>
<td class="org-left">Web攻击</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-left">Scanners</td>
<td class="org-left">扫描源</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-left">Botnets</td>
<td class="org-left">僵尸网络被控端</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">7</td>
<td class="org-left">Malware</td>
<td class="org-left">恶意软件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">8</td>
<td class="org-left">Phishing</td>
<td class="org-left">钓鱼</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">9</td>
<td class="org-left">Proxy</td>
<td class="org-left">代理</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-left">C&amp;C</td>
<td class="org-left">僵尸网络控制端</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">11</td>
<td class="org-left">Whitelist</td>
<td class="org-left">白名单</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">12</td>
<td class="org-left">Honeypot</td>
<td class="org-left">蜜罐</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">13</td>
<td class="org-left">DGA</td>
<td class="org-left">域名随机生成</td>
</tr>
</tbody>
</table></li>
<li><p>
confidence 可信度字段说明
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">置信度</th>
<th scope="col" class="org-left">取值范围说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(9-10)</td>
<td class="org-left">Certain</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(7-8)</td>
<td class="org-left">Very Confident</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(6-7)</td>
<td class="org-left">Somewhat Confident</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(5-6)</td>
<td class="org-left">Not Confident</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(5)</td>
<td class="org-left">"50/50 shot"</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(0-4)</td>
<td class="org-left">Informational Data</td>
</tr>
</tbody>
</table></li>
<li><p>
数据库内存储格式
</p>
<ul class="org-ul">
<li><p>
录入机制:
</p>

<p>
同一数据源来的数据，威胁类型不变时，
</p>

<p>
只更新该类型记录更新时间,created<sub>time不会变化</sub>
</p>

<p>
当indicator 和 tag都变化的时候，才会录入一条新的数据
</p></li>
<li><p>
更新机制
</p>

<p>
每天通过created<sub>time获取新数据</sub>
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">{
   "indicator":"1.180.74.58",
   "data_type":0,
   "confidence":7,
   "alive":true/false,
   "updated_time":"2017-06-30T14:22:44"/"none",
   "source":"blocklist.de",
   "tag":5,
   "created_time":"2017-06-30T14:22:44"
   "description":""
}
</pre>
</div></li>
</ul>
</div>
</div>
