note/note-threat_intelligence_scrapy.org
** 数据源各维度统计
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
|                              | scanner | spam | botnet | c&c | malware | phishing | whitelist | darknet | ddos | exploit | honeypot | hijacked | suspicious | data-type         |     sum |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| alexa.com                    |         |      |        |     |         |          |         5 |         |      |         |          |          |            | DOMAIN            |    1529 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| reputation.alienvault.com    |       7 |    6 |        |     |       6 |          |           |         |      |         |          |          |            | IP                |   31978 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| osint.bambenekconsulting.com |         |      |      9 |     |         |          |           |         |      |         |          |          |            | IP                |  865311 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| blocklist.de                 |       7 |      |      7 |     |         |          |           |         |      |         |          |          |            | IP                |   68711 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| umbrella.cisco.com           |         |      |        |     |         |          |         5 |         |      |         |          |          |            | DOMAIN            |    1134 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| csirtg.io                    |       9 |    9 |        |     |         |          |           |       9 |      |         |          |          |            | IP,URL,           |    1037 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| danger.rulez.sk              |       9 |      |        |     |         |          |           |         |      |         |          |          |            | IP                |    1254 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| dataplane.org                |       9 |      |        |     |         |          |           |         |      |         |          |          |            | IP                |   46710 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| emergingthreats.net          |         |      |        |     |       8 |          |           |         |      |         |          |          |            | IP                |    1289 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| abuse.ch                     |         |      |   8-10 |     |         |          |           |         |      |         |          |          |            | URL ,IP ,MD5      |   16810 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| malc0de.com                  |         |      |        |     |       9 |          |           |         |      |         |          |          |            | URL,IP,MD5        |       0 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| mirc.com                     |         |      |        |     |         |          |         8 |         |      |         |          |          |            | URL               |     191 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| netlab.360.com               |         |      |      7 |     |       7 |          |           |         |      |       7 |          |          |            | IP,URL,DOMAIN,MD5 |  889955 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| nothink.org                  |       7 |      |        |     |         |          |           |         |      |         |          |          |            | IP                |     193 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| openphish.com                |         |      |        |     |         |        9 |           |         |      |         |          |          |            | URL               |    5352 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| packetmail.net               |       8 |      |        |     |         |          |           |         |      |         |        8 |          |            | IP                |   16424 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| phishtank.com                |         |      |        |     |         |        9 |           |         |      |         |          |          |            | IP                |   27128 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| isc.sans.edu                 |       8 |      |        |     |         |          |           |         |      |         |          |          |        7-9 | IP                |       0 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| spamhaus.org                 |         |      |        |     |         |          |           |         |      |         |          |        9 |            | ASN,IPv6,Network  |    1241 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| vxvault.net                  |         |      |        |     |       9 |          |           |         |      |         |          |          |            | IP                |     196 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| otx.alienvault.com           |       5 |    5 |        |     |       5 |        5 |           |         |    5 |         |          |          |          5 | IP,URL,MD5        |       0 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| antispam.imp.ch              |         |    9 |        |     |         |          |           |         |      |         |          |          |            | IP                |       0 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| dragonresearchgroup.org      |       9 |      |        |     |         |          |           |         |      |         |          |          |            | IP                |       0 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| watcherlab.com               |         |      |        |   9 |         |          |           |         |      |         |          |          |            | IP                |       0 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
| sum                          |         |      |        |     |         |          |           |         |      |         |          |          |            |                   | 1976443 |
|------------------------------+---------+------+--------+-----+---------+----------+-----------+---------+------+---------+----------+----------+------------+-------------------+---------|
#+TBLFM: @36$14='(+ @1$14..@36$14);N
      
