note/note-threat_intelligence_scrapy.org
** DONE reputation.alienvault.com
   CLOSED: [2017-07-14 Fri 15:45]
   - State "DONE"       from ""           [2017-07-14 Fri 15:45]
** DONE osint.bambenekconsulting.com
   CLOSED: [2017-07-03 Mon 16:49]
   - State "DONE"       from "TODO"       [2017-07-03 Mon 16:49]
   - State "TODO"       from ""           [2017-06-30 Fri 16:26]
** DONE blocklist.de
   CLOSED: [2017-06-30 Fri 14:33]
   - State "DONE"       from "TODO"       [2017-06-30 Fri 14:33]
   - State "TODO"       from ""           [2017-06-29 Thu 14:07]
** DONE emergingthreats.net
   CLOSED: [2017-06-29 Thu 13:32]
   - State "DONE"       from ""           [2017-06-29 Thu 13:32]
** DONE netlab.360.com
   CLOSED: [2017-06-30 Fri 16:02]
   - State "DONE"       from "UNDO"       [2017-07-04 Tue 11:17]
   - State "UNDO"       from ""           [2017-06-30 Fri 16:02]
** DONE abuse.ch
   CLOSED: [2017-07-12 Wed 17:19]
   - State "DONE"       from "TODO"       [2017-07-12 Wed 17:19]
   - State "TODO"       from ""           [2017-07-05 Wed 12:04]
*** DONE sslbl.abuse.ch
    CLOSED: [2017-07-06 Thu 16:13]
    - State "DONE"       from ""           [2017-07-06 Thu 16:13]
*** DONE zeustracker.abuse.ch
    CLOSED: [2017-07-12 Wed 16:34]
    - State "DONE"       from ""           [2017-07-12 Wed 16:34]

*** DONE feodotracker.abuse.ch
    CLOSED: [2017-07-12 Wed 16:58]
    - State "DONE"       from ""           [2017-07-12 Wed 16:58]
*** DONE ransomware.abuse.ch
    CLOSED: [2017-07-12 Wed 17:19]
    - State "DONE"       from ""           [2017-07-12 Wed 17:19]
** DONE antispam.imp.ch
   CLOSED: [2017-06-28 Wed 10:38]
   - State "DONE"       from ""           [2017-06-28 Wed 10:38]
** DONE alexa.com
   CLOSED: [2017-07-19 Wed 15:38]
   - State "DONE"       from "TODO"       [2017-07-19 Wed 15:38]
   - State "TODO"       from ""           [2017-07-14 Fri 19:54]

   [[http://s3.amazonaws.com/alexa-static/top-1m.csv.zip][top-1000]]

** DONE public-dns.info
   CLOSED: [2017-07-20 Thu 14:16]
   - State "DONE"       from "TODO"       [2017-07-20 Thu 14:16]
** DONE umbrella.cisco.com
   CLOSED: [2017-07-24 Mon 17:12]
   - State "DONE"       from "TODO"       [2017-07-24 Mon 17:12]
   - State "TODO"       from ""           [2017-07-17 Mon 10:16]
** DONE danger.rulez.sk
   CLOSED: [2017-07-25 Tue 11:12]
   - State "DONE"       from "TODO"       [2017-07-25 Tue 11:12]
   - State "TODO"       from ""           [2017-07-17 Mon 10:16]
** DONE csirtg.io
   CLOSED: [2017-07-25 Tue 13:48]
   - State "DONE"       from "TODO"       [2017-07-25 Tue 13:48]
   - State "TODO"       from ""           [2017-07-17 Mon 10:16]
** DONE dataplane.org
   CLOSED: [2017-08-07 Mon 14:08]
   - State "DONE"       from "TODO"       [2017-08-07 Mon 14:08]
   - State "TODO"       from ""           [2017-07-25 Tue 13:48]
** DONE malc0de.com
   CLOSED: [2017-08-07 Mon 15:18]
   - State "DONE"       from "TODO"       [2017-08-07 Mon 15:18]
   - State "TODO"       from ""           [2017-07-25 Tue 13:48]

** UNDO mirc.com
   CLOSED: [2017-08-07 Mon 15:43]
   - State "UNDO"       from "TODO"       [2017-08-07 Mon 15:43]

     提供了几十个irc聊天服务器的域名地址,而且是2016年就停止更新了

   - State "TODO"       from ""           [2017-07-25 Tue 13:48]
      
** DONE nothink.org
   CLOSED: [2017-08-07 Mon 15:52]
   - State "DONE"       from "TODO"       [2017-08-07 Mon 15:52]
   - State "TODO"       from "DONE"       [2017-07-25 Tue 13:49]
** DONE openphish.com
   CLOSED: [2017-08-07 Mon 15:59]
   - State "DONE"       from "TODO"       [2017-08-07 Mon 15:59]
   - State "TODO"       from ""           [2017-07-25 Tue 13:49]
** DONE vxvazlt.net 
   CLOSED: [2017-08-23 Wed 17:36]
   - State "DONE"       from "TODO"       [2017-08-23 Wed 17:36]
   - State "TODO"       from ""           [2017-08-21 Mon 16:16]

** DONE spamhaus.org
   CLOSED: [2017-09-25 Mon 14:33]
   - State "DONE"       from "SOMEDAY"    [2017-09-25 Mon 14:33]
   需要代理 asn数据待入
   - State "TODO"       from "TODO"       [2017-08-23 Wed 12:17]
   - State "TODO"       from ""           [2017-08-21 Mon 16:16]
