note/note-threat_intelligence_scrapy.html

<div id="outline-container-orga4f9394" class="outline-3">
<h3 id="orga4f9394"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> reputation.alienvault.com</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-14 Fri 15:45]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org46d1a4e" class="outline-3">
<h3 id="org46d1a4e"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> osint.bambenekconsulting.com</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-03 Mon 16:49]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-06-30 Fri 16:26]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orga8a5dff" class="outline-3">
<h3 id="orga8a5dff"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> blocklist.de</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-06-30 Fri 14:33]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-06-29 Thu 14:07]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org66283d7" class="outline-3">
<h3 id="org66283d7"><span class="section-number-3">1.6</span> <span class="done DONE">DONE</span> emergingthreats.net</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-06-29 Thu 13:32]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org64794db" class="outline-3">
<h3 id="org64794db"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> netlab.360.com</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>State "DONE"       from "UNDO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-04 Tue 11:17]</span></span></li>
<li>State "UNDO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-06-30 Fri 16:02]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org5a27fca" class="outline-3">
<h3 id="org5a27fca"><span class="section-number-3">1.8</span> <span class="done DONE">DONE</span> abuse.ch</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-12 Wed 17:19]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-05 Wed 12:04]</span></span></li>
</ul>
</div>
<div id="outline-container-org4085adf" class="outline-4">
<h4 id="org4085adf"><span class="section-number-4">1.8.1</span> <span class="done DONE">DONE</span> sslbl.abuse.ch</h4>
<div class="outline-text-4" id="text-1-8-1">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-06 Thu 16:13]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org51e8470" class="outline-4">
<h4 id="org51e8470"><span class="section-number-4">1.8.2</span> <span class="done DONE">DONE</span> zeustracker.abuse.ch</h4>
<div class="outline-text-4" id="text-1-8-2">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-12 Wed 16:34]</span></span></li>
</ul>
</div>
</div>

<div id="outline-container-orgad59a23" class="outline-4">
<h4 id="orgad59a23"><span class="section-number-4">1.8.3</span> <span class="done DONE">DONE</span> feodotracker.abuse.ch</h4>
<div class="outline-text-4" id="text-1-8-3">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-12 Wed 16:58]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org998a225" class="outline-4">
<h4 id="org998a225"><span class="section-number-4">1.8.4</span> <span class="done DONE">DONE</span> ransomware.abuse.ch</h4>
<div class="outline-text-4" id="text-1-8-4">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-12 Wed 17:19]</span></span></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org719b6ab" class="outline-3">
<h3 id="org719b6ab"><span class="section-number-3">1.9</span> <span class="done DONE">DONE</span> antispam.imp.ch</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-06-28 Wed 10:38]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orgc024699" class="outline-3">
<h3 id="orgc024699"><span class="section-number-3">1.10</span> <span class="done DONE">DONE</span> alexa.com</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-19 Wed 15:38]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-14 Fri 19:54]</span></span></li>
</ul>

<p>
<a href="http://s3.amazonaws.com/alexa-static/top-1m.csv.zip">top-1000</a>
</p>
</div>
</div>

<div id="outline-container-orgcc7bbda" class="outline-3">
<h3 id="orgcc7bbda"><span class="section-number-3">1.11</span> <span class="done DONE">DONE</span> public-dns.info</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-20 Thu 14:16]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org06a353c" class="outline-3">
<h3 id="org06a353c"><span class="section-number-3">1.12</span> <span class="done DONE">DONE</span> umbrella.cisco.com</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-24 Mon 17:12]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-17 Mon 10:16]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd9aa08" class="outline-3">
<h3 id="orgcd9aa08"><span class="section-number-3">1.13</span> <span class="done DONE">DONE</span> danger.rulez.sk</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 11:12]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-17 Mon 10:16]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orga64f583" class="outline-3">
<h3 id="orga64f583"><span class="section-number-3">1.14</span> <span class="done DONE">DONE</span> csirtg.io</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 13:48]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-17 Mon 10:16]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org35fac9d" class="outline-3">
<h3 id="org35fac9d"><span class="section-number-3">1.15</span> <span class="done DONE">DONE</span> dataplane.org</h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-07 Mon 14:08]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 13:48]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org18f9b2a" class="outline-3">
<h3 id="org18f9b2a"><span class="section-number-3">1.16</span> <span class="done DONE">DONE</span> malc0de.com</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-07 Mon 15:18]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 13:48]</span></span></li>
</ul>
</div>
</div>

<div id="outline-container-orge77b9d7" class="outline-3">
<h3 id="orge77b9d7"><span class="section-number-3">1.17</span> <span class="done UNDO">UNDO</span> mirc.com</h3>
<div class="outline-text-3" id="text-1-17">
<ul class="org-ul">
<li><p>
State "UNDO"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-07 Mon 15:43]</span></span>
</p>

<p>
提供了几十个irc聊天服务器的域名地址,而且是2016年就停止更新了
</p></li>

<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 13:48]</span></span></li>
</ul>
</div>
</div>

<div id="outline-container-org0dd065a" class="outline-3">
<h3 id="org0dd065a"><span class="section-number-3">1.18</span> <span class="done DONE">DONE</span> nothink.org</h3>
<div class="outline-text-3" id="text-1-18">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-07 Mon 15:52]</span></span></li>
<li>State "TODO"       from "DONE"       <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 13:49]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orgb222abc" class="outline-3">
<h3 id="orgb222abc"><span class="section-number-3">1.19</span> <span class="done DONE">DONE</span> openphish.com</h3>
<div class="outline-text-3" id="text-1-19">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-07 Mon 15:59]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-07-25 Tue 13:49]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org1913748" class="outline-3">
<h3 id="org1913748"><span class="section-number-3">1.20</span> <span class="done DONE">DONE</span> vxvazlt.net</h3>
<div class="outline-text-3" id="text-1-20">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-23 Wed 17:36]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-08-21 Mon 16:16]</span></span></li>
</ul>
</div>
</div>

<div id="outline-container-orgf763a5f" class="outline-3">
<h3 id="orgf763a5f"><span class="section-number-3">1.21</span> <span class="done DONE">DONE</span> spamhaus.org</h3>
<div class="outline-text-3" id="text-1-21">
<ul class="org-ul">
<li>State "DONE"       from "SOMEDAY"    <span class="timestamp-wrapper"><span class="timestamp">[2017-09-25 Mon 14:33]</span></span></li>
</ul>
<p>
需要代理 asn数据待入
</p>
<ul class="org-ul">
<li>State "TODO"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2017-08-23 Wed 12:17]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-08-21 Mon 16:16]</span></span></li>
</ul>
</div>
</div>
