note/note-threat_intelligence_scrapy.org
** DONE phishtank.com
   CLOSED: [2017-09-25 Mon 14:32]
   - State "DONE"       from "TODO"       [2017-09-25 Mon 14:32]
   - State "TODO"       from ""           [2017-08-21 Mon 16:16]
** DONE dragonresearchgroup.org
   CLOSED: [2017-09-25 Mon 14:32]
   - State "DONE"       from "TODO"       [2017-09-25 Mon 14:32]
   - State "TODO"       from ""           [2017-09-04 Mon 11:00]
** DONE watcherlab.com
   CLOSED: [2017-10-10 Tue 17:44]
   - State "DONE"       from "TODO"       [2017-10-10 Tue 17:44]
   - State "TODO"       from "DONE"       [2017-10-10 Tue 17:27]
   - State "DONE"       from "DONE"       [2017-10-10 Tue 17:27]
   - State "TODO"       from ""           [2017-09-04 Mon 11:00]
** TODO isc.sans.edu
   需要代理 
   - State "TODO"       from "DONE"       [2017-08-24 Thu 09:51]
   - State "DONE"       from "TODO"       [2017-08-24 Thu 09:51]
   - State "TODO"       from ""           [2017-08-21 Mon 16:16]
   - source url :
      1. https://isc.sans.edu/feeds/suspiciousdomains_Low.txt
      2. https://isc.sans.edu/feeds/suspiciousdomains_High.txt
      3. https://isc.sans.edu/feeds/suspiciousdomains_Medium.txt
      4. https://isc.sans.edu/feeds/block.txt
** TODO packetmail.net
   代理问题
   - State "TODO"       from "DONE"       [2017-09-04 Mon 10:58]
   - State "DONE"       from "TODO"       [2017-08-24 Thu 09:51]
   - State "TODO"       from "DONE"       [2017-08-15 Tue 09:57]
   - source url :
     1. https://www.packetmail.net/iprep.txt
     2. https://www.packetmail.net/iprep_mail.txt
     3. https://www.packetmail.net/iprep_ramnode.txt
** TODO otx.alienvault.com
   - State "TODO"       from ""           [2017-10-10 Tue 15:22]
   - source url :
      1. https://sslbl.abuse.ch/blacklist/sslipblacklist.csv
      2. https://sslbl.abuse.ch/blacklist/dyre_sslipblacklist.csv
      3. https://sslbl.abuse.ch/blacklist/sslblacklist.csv
** TODO malwaredomainlist.com
   - State "TODO"       from ""           [2017-09-25 Mon 14:35]
     
** TODO badips.com
   - State "TODO"       from              [2018-11-09 Fri 12:02]
    source url : 
    1. https://www.badips.com/get/list/any/2?age=7d

** TODO raw.githubusercontent.com
   - State "TODO"       from              [2018-11-09 Fri 12:03]
   source url: 
   1. https://raw.githubusercontent.com/firehol/blocklist-ipsets/master/botscout_1d.ipset
   2. https://raw.githubusercontent.com/firehol/blocklist-ipsets/master/cruzit_web_attacks.ipset

** TODO cinsscore.com
   - State "TODO"       from              [2018-11-09 Fri 12:03]
   source url: 
   1. http://cinsscore.com/list/ci-badguys.txt

** TODO cybercrime-tracker.net
   - State "TODO"       from              [2018-11-09 Fri 12:03]
   source url:
   1. http://cybercrime-tracker.net/ccam.php

** TODO dataplane.org
   - State "TODO"       from              [2018-11-09 Fri 12:03]
   source url: 
   1. https://dataplane.org/dnsrd.txt
   2. https://dataplane.org/dnsrd.txt
   3. https://dataplane.org/dnsversion.txt
   4. https://dataplane.org/vncrfb.txt

** TODO blocklist.greensnow.co
   - State "TODO"       from              [2018-11-09 Fri 12:04]
   source url: 
   1. http://blocklist.greensnow.co/greensnow.txt

** TODO malwaredomainlist.com
   - State "TODO"       from              [2018-11-09 Fri 12:04]
   source url:
   1. http://www.malwaredomainlist.com/hostslist/ip.txt

** TODO maxmind.com
   - State "TODO"       from              [2018-11-09 Fri 12:04]
   source url: 
   1. https://www.maxmind.com/en/high-risk-ip-sample-list

** TODO rutgers.edu
   - State "TODO"       from              [2018-11-09 Fri 12:05]
   source url: 
   1. https://report.cs.rutgers.edu/DROP/attackers
